import React from "react";

type Props = {};

export default function Page({}: Props) {
  return (
    <div>
      <h1 className="text-2xl font-bold mt-14 mb-10 text-center">
        سياسة الخصوصية
      </h1>

      <div className="max-w-[1000px]  mx-5 lg:mx-auto text-justify">
        <h2 className="text-xl font-bold mb-2">التزامنا بمراعاة خصوصيتك</h2>
        <p>
          يلتزم مكتب العميد للخرسانه المطبوعة والهليكوبتر بحماية خصوصية عملائنا.
          وتنطبق سياسة حماية الخصوصية المعتمدة من قبل العميد للخرسانه المطبوعة
          والهليكوبتر ("سياسة حماية الخصوصية") على كل المعلومات الشخصية التي يتم
          جمعها من قبلنا أو تقديمها لنا، إن دون الاتصال بالإنترنت (offline) أو
          بالاتصال بالإنترنت (online)، بما في ذلك المعلومات الشخصية التي يتم
          جمعها أو تقديمها من خلال مواقعنا الإلكترونية ("مواقعنا الإلكترونية")
          وعلى أي مواقع على الهواتف الجوالة والتطبيقات الصغيرة وغيرها من الميزات
          التفاعلية للجوّال (والمشار إليها مجتمعةً بـ"تطبيقاتنا")، من خلال
          صفحاتنا الرسمية على وسائل التواصل الاجتماعي التي نتحكم بها ("صفحاتنا
          على وسائل التواصل الاجتماعي")، ومن خلال رسائل HTML التي نرسلها إليكم
          (والمشار إليها مجتمعةً، بما في ذلك الصفحات على وسائل التواصل الاجتماعي
          والتطبيقات والمواقع الإلكترونية، بـ"المواقع"). ومن خلال تقديمكم
          المعلومات الشخصية لنا، توافقون على أحكام وشروط هذه السياسة.
        </p>
      </div>
    </div>
  );
}
